[
  {"id":"blokCan2001","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokCan2001","issued":{"date-parts":[["2001"]]},"license":"All rights reserved","note":"Presentation for Emergent Phenomena discussion group, U.B.C.","title":"Can memes drive genes?","type":"speech"},
  {"id":"blokConditions2002","abstract":"Assuming culture is transmitted horizontally (via imitation) a model was constructed to determine the conditions under which culture can dominate genetic evolution (\"get off the leash\" according to Blackmore). Two requirements were found: (1) culture must compete with genes (required only for the effect to be empirically testable); and (2) Interactions between individuals must be confined to small groups or neighbourhoods. The model was tested via analysis and simulation.","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokConditions2002","issued":{"date-parts":[["2002"]]},"license":"All rights reserved","note":"Unpublished.","title":"Conditions for memetic driving","type":"manuscript"},
  {"id":"blokDiscounted1997","accessed":{"date-parts":[["2012",2,21]]},"author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokDiscounted1997","issued":{"date-parts":[["1997",7,20]]},"license":"All rights reserved","title":"Discounted Least Squares Curve Fitting","title-short":"Discounted Least Squares","type":"webpage","URL":"http://www.zoology.ubc.ca/~rikblok/wiki/doku.php?id=random_research:rik_s_notes:discounted_least_squares:start"},
  {"id":"blokEffect1997","abstract":"The debate as to whether the ``game of Life'' is self-organized critical remains unresolved. We present evidence that boundary conditions play an important role in the scaling behavior, resulting in apparently contradictory results. We develop an analytic form for the scaling function, and demonstrate that periodic boundaries force saturation, while open boundaries exhibit no such transitions on similar scales. We also consider the removal of boundaries altogether.","accessed":{"date-parts":[["2012",2,22]]},"author":[{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Bergersen","given":"Birger"}],"citation-key":"blokEffect1997","container-title":"Physical Review E","container-title-short":"Phys. Rev. E","DOI":"10.1103/PhysRevE.55.6249","issue":"5","issued":{"date-parts":[["1997",5,1]]},"license":"All rights reserved","page":"6249-6252","source":"APS","title":"Effect of boundary conditions on scaling in the \"game of Life\"","type":"article-journal","URL":"http://link.aps.org/doi/10.1103/PhysRevE.55.6249","volume":"55"},
  {"id":"blokExtra1998","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokExtra1998","issued":{"date-parts":[["1998",3]]},"license":"All rights reserved","note":"Presentation for Peter Wall Inst.\\ Adv.\\ Science, Crisis Points Group, U.B.C.","title":"Extra! Extra! Critical Update on Life","type":"speech"},
  {"id":"blokLife1995","abstract":"Recently, a class of phenomena known as self-organized criticality (SOC) has been\ndiscovered. SOC is characterized by two properties: firstly, the system exhibits power law\nbehavior typical of a critical state, with no characteristic time or length scales; and\nsecondly, this state is approached naturally, without tuning any external parameters. Early\nstudies explained SOC in terms of conserved quantities [1,2]. Then Bak et al. [3]\nsuggested that the Game of Life, GL, a cellular automaton lacking any conserved\nquantities, also exhibited SOC. This sparked a debate as to whether GL truly is SOC;\nconflicting data suggested it was subcritical [4,5,6].\nIn this paper I explore both sides of the argument in an attempt to resolve the\nissue. By finding an explicit form for the scaling function the opposing arguments are\nreconciled and, with some slight reservations, GL is judged to be subcritical. The\ndifferences between the analysis herein and other studies is highlighted.\nI also introduce the reader to some other interesting features of GL, and cellular\nautomata in general, in order to elicit the proper respect for these simple yet complex\nmodels. In doing so I hope to impress upon the reader the insufficiencies of the available\nanalytical tools. New methods are required to account for the long-range correlations\nwhich develop in GL and other deterministic automata.","accessed":{"date-parts":[["2012",2,21]]},"author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokLife1995","genre":"Master's Thesis","issued":{"date-parts":[["1995",11]]},"license":"All rights reserved","publisher":"University of British Columbia","title":"Life without bounds: does the game of life exhibit self-organized criticality in the thermodynamic limit?","title-short":"Life without bounds","type":"thesis","URL":"https://circle.ubc.ca/handle/2429/4037"},
  {"id":"blokModelling1998","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokModelling1998","issued":{"date-parts":[["1998",12,1]]},"license":"All rights reserved","note":"Presentation for Physics 510 \"Stochastic Processes in Physics\", U.B.C.","title":"Modelling Intentionality: The Gambler","type":"speech"},
  {"id":"blokNature2000","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokNature2000","issued":{"date-parts":[["2000"]]},"license":"All rights reserved","note":"Final PhD oral defense, U.B.C.","title":"On the nature of the stock market: Simulations and experiments (Final defense)","type":"speech"},
  {"id":"blokNature2000a","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokNature2000a","issued":{"date-parts":[["2000"]]},"license":"All rights reserved","note":"Departmental PhD oral defense, U.B.C.","title":"On the nature of the stock market: Simulations and experiments (Departmental defense)","title-short":"Blok2000","type":"speech"},
  {"id":"blokNature2000b","abstract":"Over the last few years there has been a surge of activity within the physics community in the emerging field of Econophysics—the study of economic systems from a physicist's perspective. Physicists tend to take a different view than economists and other social scientists, being interested in such topics as phase transitions and fluctuations. In this dissertation two simple models of stock exchange are developed and simulated numerically. The first is characterized by centralized trading with a market maker. Fluctuations are driven by a stochastic component in the agents' forecasts. As the scale of the fluctuations is varied a critical phase transition is discovered. Unfortunately, this model is unable to generate realistic market dynamics. The second model discards the requirement of centralized trading. In this case the stochastic driving force is Gaussian-distributed \"news events\" which are public knowledge. Under variation of the control parameter the model exhibits two phase transitions: both a first- and a second-order (critical). The decentralized model is able to capture many of the interesting properties observed in empirical markets such as fat tails in the distribution of returns, a brief memory in the return series, and long-range correlations in volatility. Significantly, these properties only emerge when the parameters are tuned such that the model spans the critical point. This suggests that real markets may operate at or near a critical point, but is unable to explain why this should be. This remains an interesting open question worth further investigation. One of the main points of the thesis is that these empirical phenomena are not present in the stochastic driving force, but emerge endogenously from interactions between agents. Further, they emerge despite the simplicity of the modeled agents; suggesting complex market dynamics do not arise from the complexity of individual investors but simply from interactions between (even simple) investors. Although the emphasis of this thesis is on the extent to which multi-agent models can produce complex dynamics, some attempt is also made to relate this work with empirical data. Firstly, the trading strategy applied by the agents in the second model is demonstrated to be adequate, if not optimal, and to have some surprising consequences. Secondly, the claim put forth by Sornette et al. that large financial crashes may be heralded by accelerating precursory oscillations is also tested. It is shown that there is weak evidence for the existence of log-periodic precursors but the signal is probably too indistinct to allow for reliable predictions.","accessed":{"date-parts":[["2012",2,22]]},"author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokNature2000b","issued":{"date-parts":[["2000"]]},"license":"All rights reserved","publisher":"University of British Columbia","title":"On the nature of the stock market: Simulations and experiments","type":"thesis","URL":"http://hdl.handle.net/2429/11108"},
  {"id":"blokParallel2004","accessed":{"date-parts":[["2012",2,22]]},"author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokParallel2004","issued":{"date-parts":[["2004",10,15]]},"license":"All rights reserved","title":"Parallel Poisson: Updating in simulations of parallel Poisson processes","title-short":"Parallel Poisson","type":"webpage","URL":"http://www.zoology.ubc.ca/~rikblok/wiki/doku.php?id=random_research:rik_s_notes:parallel_poisson:start"},
  {"id":"blokRik2016","abstract":"This report lays out the work I have been doing as part of my Integrated Sciences Lecturer (75% full-time) appointment, focusing on non-teaching “service” duties.  Hopefully, it will help determine what I should be doing, whether the workload is appropriate, and whether any duties might be better handled by somebody else so I can focus more on teaching.  I propose a plan to add ISCI 360 to my teaching duties (as included in my latest offer letter) while reducing my service work to fit within my 75% appointment.  The plan would require shifting some of my current duties to other parties.","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokRik2016","event-place":"Available on request.  Contact Rik Blok at rik.blok@ubc.ca","issued":{"date-parts":[["2016",12,8]]},"license":"All rights reserved","publisher":"University of British Columbia","publisher-place":"Available on request.  Contact Rik Blok at rik.blok@ubc.ca","title":"Rik's IntSci Service Work","type":"report"},
  {"id":"blokRock2002","abstract":"Presentation given at the Dec. 2, 2002 SOWD Lab Meeting. A demonstration of how the simulation tool R2DToo can be used to solve real problems.","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokRock2002","issued":{"date-parts":[["2002"]]},"license":"All rights reserved","note":"SOWD Lab Meeting, Zoology, U.B.C.","title":"Rock, paper and scissors in space: A demonstration of R2DToo","type":"speech"},
  {"id":"blokScholarly2018","abstract":"ISCI 320 Research Development Retreat is a novel and exciting inquiry-driven course at UBC.  Here I show the scholarly approaches taken in its design and implementation.  Course goals, activities, and assessments are related in a concept map.  Effectiveness of the course is demonstrated through three lines of evidence: (1) improvement in report grades, (2) improvement in measures of science comprehension, and (3) student reflections.  Results demonstrate that ISCI 320 is a very effective course.","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokScholarly2018","event-place":"Available on request.  Contact Rik Blok at rik.blok@ubc.ca","issued":{"date-parts":[["2018",5,8]]},"license":"All rights reserved","publisher":"University of British Columbia","publisher-place":"Available on request.  Contact Rik Blok at rik.blok@ubc.ca","title":"Scholarly approaches to teaching ISCI 320 Research Development Retreat","type":"report"},
  {"id":"blokSelfaffine2003","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokSelfaffine2003","issued":{"date-parts":[["2003"]]},"license":"All rights reserved","note":"Guest lecture for U.B.C. Physics 510: Stochastic Processes in Physics","title":"Self-affine timeseries analysis","type":"speech"},
  {"id":"blokStatistical2002","abstract":"A brief introduction to Lévy flight and fractional Brownian motion from the experimentalist's perspective. Simple tools to analyze these timeseries, the Zipf plot and dispersional analysis, are presented. As a demonstration, these tools are applied to intraday foreign exchange data to determine the Lévy and Hurst exponents.","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokStatistical2002","issued":{"date-parts":[["2002"]]},"license":"All rights reserved","note":"PIMS-MITACS Math Finance Seminar, U.B.C.","title":"Statistical properties of financial timeseries","type":"speech"},
  {"id":"blokSynchronous1999","abstract":"The rules for the “game of Life” are modified to allow for only a random fraction of sites to be updated in each time step. Under variation of this fraction from the parallel updating limit down to the Poisson limit, a critical phase transition is observed that explains why the game of Life appears to obey self-organized criticality. The critical exponents are calculated and the static exponents appear to belong to the directed percolation universality class in 2+1 dimensions. The dynamic exponents, however, are nonuniversal, as seen in other systems with multiple absorbing states.","accessed":{"date-parts":[["2012",2,22]]},"author":[{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Bergersen","given":"Birger"}],"citation-key":"blokSynchronous1999","container-title":"Physical Review E","container-title-short":"Phys. Rev. E","DOI":"10.1103/PhysRevE.59.3876","issue":"4","issued":{"date-parts":[["1999",4,1]]},"license":"All rights reserved","page":"3876-3879","source":"APS","title":"Synchronous versus asynchronous updating in the \"game of Life\"","type":"article-journal","URL":"http://link.aps.org/doi/10.1103/PhysRevE.59.3876","volume":"59"},
  {"id":"blokTeaching2018","author":[{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"blokTeaching2018","event-place":"Available on request.  Contact Rik Blok at rik.blok@ubc.ca","issued":{"date-parts":[["2019",11,23]]},"license":"All rights reserved","publisher":"University of British Columbia","publisher-place":"Available on request.  Contact Rik Blok at rik.blok@ubc.ca","title":"Teaching Portfolio","type":"report"},
  {"id":"doebeliMultimodal2007","abstract":"During bouts of evolutionary diversification, such as adaptive radiations, the emerging species cluster around different locations in phenotype space. How such multimodal patterns in phenotype space can emerge from a single ancestral species is a fundamental question in biology. Frequency-dependent competition is one potential mechanism for such pattern formation, as has previously been shown in models based on the theory of adaptive dynamics. Here, we demonstrate that also in models similar to those used in quantitative genetics, phenotype distributions can split into multiple modes under the force of frequency-dependent competition. In sexual populations, this requires assortative mating, and we show that the multimodal splitting of initially unimodal distributions occurs over a range of assortment parameters. In addition, assortative mating can be favoured evolutionarily even if it incurs costs, because it provides a means of alleviating the effects of frequency dependence. Our results reveal that models at both ends of the spectrum between essentially monomorphic (adaptive dynamics) and fully polymorphic (quantitative genetics) yield similar results. This underscores that frequency-dependent selection is a strong agent of pattern formation in phenotype distributions, potentially resulting in adaptive speciation.","accessed":{"date-parts":[["2012",2,21]]},"author":[{"family":"Doebeli","given":"Michael"},{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Leimar","given":"Olof"},{"family":"Dieckmann","given":"Ulf"}],"citation-key":"doebeliMultimodal2007","container-title":"Proceedings of the Royal Society B: Biological Sciences","DOI":"10.1098/rspb.2006.3725","ISSN":"0962-8452, 1471-2954","issue":"1608","issued":{"date-parts":[["2007",2,7]]},"license":"All rights reserved","page":"347-357","source":"rspb.royalsocietypublishing.org","title":"Multimodal pattern formation in phenotype distributions of sexual populations","type":"article-journal","URL":"http://rspb.royalsocietypublishing.org/content/274/1608/347","volume":"274"},
  {"id":"grafStudent2020","accessed":{"date-parts":[["2021",1,28]]},"author":[{"family":"Graf","given":"Peter"},{"family":"Dias","given":"Manuel"},{"family":"Baniassad","given":"Elisa"},{"family":"Bartolic","given":"Silvia"},{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Entremont","given":"Agnes","non-dropping-particle":"d'"},{"family":"Englund","given":"Letitia"},{"family":"Faber","given":"Shawna"},{"family":"Kato","given":"Tim"},{"family":"Walsh Marr","given":"Jennifer"},{"family":"Ostafichuk","given":"Peter"},{"family":"Cao","given":"Yang"},{"family":"Chan","given":"Vania"},{"family":"Soon","given":"Zoe"}],"citation-key":"grafStudent2020","issued":{"date-parts":[["2020",11]]},"license":"All rights reserved","title":"Student Peer Assessment Tools Working Group: 2020 Final Report & Recommendations","type":"webpage","URL":"https://lthub.ubc.ca/projects/working-groups/#spa-tools"},
  {"id":"gravesTLEF2019","abstract":"Game theory is a complex, multidisciplinary subject with applications across both the arts and sciences. However, because of this complexity, students often lack opportunities to explore these ideas in a way which allows for concrete experiences and experimentation: critical elements of experiential learning. This project aims to address this by developing a user-friendly framework for students to explore game theory in the context of repeated games – one of the most important and broadly applicable concepts in the field.\n\nSpecifically, we will develop an educational application that allows students to build their own strategies to take part in a repeated game similar to the seminal experiment of Axelrod (1980). The application will be accessible to students with no programming experience, facilitating experiential learning, peer- learning, and engagement. It will be accompanied by a set of learning modules and assessments, to integrate the material into a variety of instructional settings.","accessed":{"date-parts":[["2019",6,20]]},"author":[{"family":"Graves","given":"Jonathan"},{"family":"Blok","given":"Hendrik J. (Rik)"}],"citation-key":"gravesTLEF2019","issued":{"date-parts":[["2019",4,1]]},"license":"All rights reserved","title":"TLEF Funded Proposal: Experiential Learning in Game Theory: Axelrod's Tournament","type":"manuscript","URL":"https://tlef.ubc.ca/funded-proposals/entry/387/"},
  {"id":"killingbackScalefree2006","abstract":"Much of the work on extinction events has focused on external perturbations of ecosystems, such as climatic change, or anthropogenic factors. Extinction, however, can also be driven by endogenous factors, such as the ecological interactions between species in an ecosystem. Here we show that endogenously driven extinction events can have a scale-free distribution in simple spatially structured host–parasitoid systems. Due to the properties of this distribution there may be many such simple ecosystems that, although not strictly permanent, persist for arbitrarily long periods of time. We identify a critical phase transition in the parameter space of the host–parasitoid systems, and explain how this is related to the scale-free nature of the extinction process. Based on these results, we conjecture that scale-free extinction processes and critical phase transitions of the type we have found may be a characteristic feature of many spatially structured, multi-species ecosystems in nature. The necessary ingredient appears to be competition between species where the locally inferior type disperses faster in space. If this condition is satisfied then the eventual outcome depends subtly on the strength of local superiority of one species versus the dispersal rate of the other.","accessed":{"date-parts":[["2012",2,20]]},"author":[{"family":"Killingback","given":"Timothy"},{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Doebeli","given":"Michael"}],"citation-key":"killingbackScalefree2006","container-title":"Journal of Theoretical Biology","DOI":"10.1016/j.jtbi.2006.01.010","ISSN":"0022-5193","issue":"4","issued":{"date-parts":[["2006",8,21]]},"license":"All rights reserved","page":"745-750","source":"ScienceDirect","title":"Scale-free extinction dynamics in spatially structured host–parasitoid systems","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S0022519306000129","volume":"241"},
  {"id":"moosviComPAIR2018","abstract":"Giving and receiving feedback has been identified as a key focus in redesigning assessments for long term learning (Boud, 2006) as peer feedback has been shown to improve motivation (White, 1998) and provide learning benefits (Jhangiani, 2016). However, challenges in implementation have prevented its widespread use. Leveraging the process of comparative judgement has the potential to facilitate peer feedback and assessment at scale. Performing an active comparative process facilitates students’ future learning by enabling them to go beyond identifying superficial features of a phenomenon (Bransford,1999; Schwartz,1998). Developing the capacity in students to be an effective ‘assessor of learning’ prepares students for lifelong learning by preparing them to make complex judgements about their own work, as well as that of their peers (Boud, 2006).\n\nComPAIR is an adaptive comparative judgement (ACJ)-based online learning tool that facilitates peer feedback at scale (Potter, 2017) and has recently been proposed as reliable in assessing complex items (Pollitt, 2012). Learners evaluate, comment upon, and rank pairs of submissions in many classroom contexts across disciplines (English, Mathematics, Integrated Sciences, and Physics courses for this study). In previous work, particularly in the English and Physics cohorts, students found the tool intuitive to use and reported very strong perceptions of improved ability and confidence in their ability to complete a similar task in future or to begin a more complex related task. Students perceive ComPAIR as an effective tool for teaching and learning (Potter, 2017). Others have shown that feedback from multiple peers led to more significant improvements in revised papers than feedback provided by experts (Cho, 2007).\n\nIn addition to the cognitive benefits of assessing peer assignments and providing feedback, ComPAIR may reduce marking load and increase consistency (Pollitt, 2012). English (ENGL110; 150 students) and Integrated Sciences (ISCI360; 44 students) were used to evaluate ComPAIR for grading. Each student in ENGL110 judged three pairs of submissions on one criterion and ISCI360 students assessed six pairs on three criteria. Expert judgements on the same submissions were also made in ComPAIR to evaluate the reliability of the tool. The assignments were also manually graded by two teaching assistants. Simulation data suggest that the effect of ‘misjudgements’ has a large impact tool reliability, especially with a limited amount of judgements. In this presentation we will share results of our study using ComPAIR as a tool for assessment, and provide evidence-based practices for using ComPAIR in the classroom.","accessed":{"date-parts":[["2020",3,9]]},"author":[{"family":"Moosvi","given":"Firas"}],"citation-key":"moosviComPAIR2018","contributor":[{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Potter","given":"Tiffany"},{"family":"Charbonneau","given":"James"},{"family":"Englund","given":"Letitia"},{"family":"Gardener","given":"Andrew"},{"family":"Luo","given":"Pan"},{"family":"Roll","given":"Ido"}],"event-place":"Bergen, Norway","event-title":"ISSOTL18: Toward a Learning Culture","issued":{"date-parts":[["2018",10,26]]},"language":"en-US","license":"All rights reserved","publisher-place":"Bergen, Norway","source":"issotl18.w.uib.no","title":"ComPAIR: an Online Adaptive Comparative Judgement Tool for Peer Feedback and Assessment – ISSOTL18 – Bergen, Norway","title-short":"ComPAIR","type":"speech","URL":"https://issotl18.w.uib.no/poster-session/compair-an-online-adaptive-comparative-judgement-tool-for-peer-feedback-and-assessment/"},
  {"id":"pineda-krchTale2007","abstract":"Periodic predator–prey dynamics in constant environments are usually taken as indicative of deterministic limit cycles. It is known, however, that demographic stochasticity in finite populations can also give rise to regular population cycles, even when the corresponding deterministic models predict a stable equilibrium. Specifically, such quasi-cycles are expected in stochastic versions of deterministic models exhibiting equilibrium dynamics with weakly damped oscillations. The existence of quasi-cycles substantially expands the scope for natural patterns of periodic population oscillations caused by ecological interactions, thereby complicating the conclusive interpretation of such patterns. Here we show how to distinguish between quasi-cycles and noisy limit cycles based on observing changing population sizes in predator–prey populations. We start by confirming that both types of cycle can occur in the individual-based version of a widely used class of deterministic predator–prey model. We then show that it is feasible and straightforward to accurately distinguish between the two types of cycle through the combined analysis of autocorrelations and marginal distributions of population sizes. Finally, by confronting these results with real ecological time series, we demonstrate that by using our methods even short and imperfect time series allow quasi-cycles and limit cycles to be distinguished reliably.","accessed":{"date-parts":[["2012",2,19]]},"author":[{"family":"Pineda-Krch","given":"Mario"},{"family":"Blok","given":"Hendrik J. (Rik)"},{"family":"Dieckmann","given":"Ulf"},{"family":"Doebeli","given":"Michael"}],"citation-key":"pineda-krchTale2007","container-title":"Oikos","DOI":"10.1111/j.2006.0030-1299.14940.x","ISSN":"1600-0706","issue":"1","issued":{"date-parts":[["2007",1,1]]},"language":"en","license":"All rights reserved","page":"53-64","source":"Wiley Online Library","title":"A tale of two cycles - distinguishing quasi-cycles and limit cycles in finite predator-prey populations","type":"article-journal","URL":"http://onlinelibrary.wiley.com/doi/10.1111/j.2006.0030-1299.14940.x/abstract","volume":"116"}
]
